/* Задача 28. Напишите программу, которая принимает на вход число N и выдаёт
произведение чисел от 1 до N.
Например: 4->24   5->120
*/

System.Console.WriteLine("Введите чсло: ");

int userNum = int.Parse(System.Console.ReadLine());
int Factorial(int num)
{
    for (int i = 1; i <= userNum; i++)
     {
        result *= i;
     }


}